Repository: Bhanditz/DoneXBlock
Catalog: done/translations/*/LC_MESSAGES/text.po
Languages: eo

source: Is the student done?
eo: Ìs thé stüdént döné? Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, #

source: Align left/right/center
eo: Àlïgn léft/rïght/çéntér Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σ#

source: Completion
eo: Çömplétïön Ⱡ'σяєм ιρѕυм ∂σłσ#

source: Display name
eo: Dïspläý nämé Ⱡ'σяєм ιρѕυм ∂σłσя ѕ#

source: ISO-8601 formatted string representing the start date of this assignment. We ignore this.
eo: ÌSÖ-8601 förmättéd strïng répréséntïng thé stärt däté öf thïs ässïgnmént. Wé ïgnöré thïs. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕ#

source: ISO-8601 formatted string representing the due date of this assignment. We ignore this.
eo: ÌSÖ-8601 förmättéd strïng répréséntïng thé düé däté öf thïs ässïgnmént. Wé ïgnöré thïs. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє#

source: Problem Weight
eo: Prößlém Wéïght Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#

source: Defines the number of points each problem is worth. If the value is not set, the problem is worth the sum of the option point values.
eo: Défïnés thé nümßér öf pöïnts éäçh prößlém ïs wörth. Ìf thé välüé ïs nöt sét, thé prößlém ïs wörth thé süm öf thé öptïön pöïnt välüés.#

source: X
eo: X Ⱡ#

source: I have completed this
eo: Ì hävé çömplétéd thïs Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, #

source: Unmark
eo: Ûnmärk Ⱡ'σяєм ιρѕυ#

source: Mark as complete
eo: Märk äs çömplété Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αм#

source: This is a very simple component with no configuration options. It is used for helping student keep track of what portion of a course they've completed. For example, you might place this underneath each text and video component, and students can see in their progress page which portions are completed and which still need to be watched or read.
eo: Thïs ïs ä vérý sïmplé çömpönént wïth nö çönfïgürätïön öptïöns. Ìt ïs üséd för hélpïng stüdént kéép träçk öf whät pörtïön öf ä çöürsé théý'vé çömplétéd. För éxämplé, ýöü mïght pläçé thïs ündérnéäth éäçh téxt änd vïdéö çömpönént, änd stüdénts çän séé ïn théïr prögréss pägé whïçh pörtïöns äré çömplétéd änd whïçh stïll nééd tö ßé wätçhéd ör réäd. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιρι#

source: It is also helpful to give students a way to sign off on having completed something. They are less likely to skip material that way.
eo: Ìt ïs älsö hélpfül tö gïvé stüdénts ä wäý tö sïgn öff ön hävïng çömplétéd söméthïng. Théý äré léss lïkélý tö skïp mätérïäl thät wäý. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιριѕι¢ιηg єłιт, ѕє∂ ∂σ єιυѕмσ∂ тємρσя ιη¢ι∂ι∂υηт υт łαвσяє єт ∂σłσяє мαgηα αłιqυα. υт єηιм α∂ мιηιм νєηιαм, qυιѕ ησѕтяυ∂ єχєя¢ιтαтιση υłłαм¢σ łαвσяιѕ ηιѕι υт αłιqυιρ єχ єα ¢σммσ∂σ ¢σηѕєqυαт. ∂υιѕ αυтє ιяυяє ∂σłσя ιη яєρяєнєη∂єяιт ιη νσłυρтαтє νєłιт єѕѕє ¢ιłłυм ∂σłσяє єυ ƒυgιαт ηυłłα ραяιαтυя. єχ¢єρтєυя ѕιηт σ¢¢αє¢αт ¢υρι∂αтαт ηση ρяσι∂єηт, ѕυηт ιη ¢υłρα qυι σƒƒι¢ια ∂єѕєяυηт мσłłιт αηιм ι∂ єѕт łαвσя#

source: (If you're a real power-user, in OLX, we do allow you to add an align tag, which can left-, center-, or right-justify the XBlock)
eo: (Ìf ýöü'ré ä réäl pöwér-üsér, ïn ÖLX, wé dö ällöw ýöü tö ädd än älïgn täg, whïçh çän léft-, çéntér-, ör rïght-jüstïfý thé XBlöçk) Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιριѕι¢ιηg єłιт, ѕє∂ ∂σ єιυѕмσ∂ тємρσя ιη¢ι∂ι∂υηт υт łαвσяє єт ∂σłσяє мαgηα αłιqυα. υт єηιм α∂ мιηιм νєηιαм, qυιѕ ησѕтяυ∂ єχєя¢ιтαтιση υłłαм¢σ łαвσяιѕ ηιѕι υт αłιqυιρ єχ єα ¢σммσ∂σ ¢σηѕєqυαт. ∂υιѕ αυтє ιяυяє ∂σłσя ιη яєρяєнєη∂єяιт ιη νσłυρтαтє νєłιт єѕѕє ¢ιłłυм ∂σłσяє єυ ƒυgιαт ηυłłα ραяιαтυя. єχ¢єρтєυя ѕιηт σ¢¢αє¢αт ¢υρι∂αтαт ηση ρяσι∂єηт, ѕυηт ιη ¢υłρα qυι σƒƒι¢ια ∂єѕєяυηт мσłłιт αηιм ι∂ єѕт łαвσ#
